app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("name", "comment", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dana"], ["comment", "cool article"], ["post_id", 4], ["created_at", "2015-10-18 18:32:29.952497"], ["updated_at", "2015-10-18 18:32:29.952497"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)