app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["text", "test"], ["created_at", "2015-10-18 17:18:07.022186"], ["updated_at", "2015-10-18 17:18:07.022186"]]

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "some stuff has been changed!"], ["updated_at", "2015-10-18 19:30:48.906857"], ["id", 3]]